[
  {
    "name": "Artificer",
    "hit_dice": "1d8 per artificer level",
    "hit_points_at_1st_level": "8 + your Constitution modifier",
    "hit_points_at_higher_levels": "1d8 (or 5) + your Constitution modifier per artificer level after 1st",
    "proficiencies": {
      "armor": ["Light armor", "Medium armor", "Shields"],
      "weapons": ["Simple weapons", "Firearms"],
      "tools": ["Thieves' tools", "Tinker's tools", "One type of artisan's tools of your choice"],
      "saving_throws": ["Constitution", "Intelligence"],
      "skills": ["Choose two from Arcana, History, Investigation, Medicine, Nature, Perception, Sleight of Hand"]
    },
    "equipment": [
      "(a) any two simple weapons or (b) a light crossbow and 20 bolts",
      "(a) a light crossbow and 20 bolts or (b) any simple weapon",
      "(a) studded leather armor or (b) scale mail",
      "Thieves' tools and dungeoneer's pack"
    ],
    "class_features": [
      {
        "level": 1,
        "features": [
          {
            "name": "Spellcasting",
            "description": "You study the fundamentals of magic and learn to cast artificer spells."
          },
          {
            "name": "Magical Tinkering",
            "description": "You've learned how to invest a spark of magic into mundane objects. As an action, you can touch a Tiny nonmagical object and imbue it with one of the following magical properties of your choice: The object sheds bright light in a 5-foot radius and dim light for an additional 5 feet. Whenever tapped by a creature, the object emits a recorded message that can be heard up to 10 feet away. The object continuously emits your choice of an odor or a nonverbal sound. A static visual effect appears on one of the object's surfaces. You can have a number of objects infused with magic at the same time equal to your Intelligence modifier (minimum of one object)."
          }
        ]
      },
      {
        "level": 2,
        "features": [
          {
            "name": "Infuse Item",
            "description": "You've gained the ability to imbue mundane items with certain magical infusions. You learn how to use these infusions, which are detailed at the end of the class description."
          },
          {
            "name": "Infuse Item (Known Infusions)",
            "description": "At 2nd level, you learn two infusions of your choice. You can learn additional infusions at higher levels, as shown in the Infusions Known column of the Artificer table."
          }
        ]
      },
      {
        "level": 3,
        "features": [
          {
            "name": "Artificer Specialist",
            "description": "You choose the type of artificer you want to be: Alchemist, Armorer, Artillerist, or Battle Smith. Your choice grants you features at 3rd level and again at 5th, 9th, and 15th level."
          }
        ]
      },
      {
        "level": 5,
        "features": [
          {
            "name": "Extra Attack",
            "description": "You can attack twice, instead of once, whenever you take the Attack action on your turn."
          }
        ]
      },
      {
        "level": 7,
        "features": [
          {
            "name": "Flash of Genius",
            "description": "You've gained the ability to come up with solutions under pressure. When you or another creature you can see within 30 feet of you makes an ability check or a saving throw, you can use your reaction to add your Intelligence modifier to the roll."
          }
        ]
      },
      {
        "level": 10,
        "features": [
          {
            "name": "Magic Item Adept",
            "description": "You can attune to up to four magic items at once."
          }
        ]
      },
      {
        "level": 11,
        "features": [
          {
            "name": "Spell-Storing Item",
            "description": "You can now store a spell in an object. Whenever you finish a long rest, you can touch one simple or martial weapon or one item that you can use as a spellcasting focus, and you store a spell in it."
          }
        ]
      },
      {
        "level": 14,
        "features": [
          {
            "name": "Magic Item Savant",
            "description": "You can attune to up to five magic items at once."
          }
        ]
      },
      {
        "level": 18,
        "features": [
          {
            "name": "Magic Item Master",
            "description": "You can attune to up to six magic items at once."
          }
        ]
      },
      {
        "level": 20,
        "features": [
          {
            "name": "Soul of Artifice",
            "description": "You've developed a mystical connection to your magic items, which you can draw on for protection. You gain a +1 bonus to all saving throws per magic item you are currently attuned to. If you're reduced to 0 hit points but not killed outright, you can use your reaction to end one of your artificer infusions, causing you to drop to 1 hit point instead of 0."
          }
        ]
      }
    ],
    "spellcasting": {
      "ability": "Intelligence",
      "cantrips_known": {
        "1": 2
      },
      "spell_slots": {
        "1": [2],
        "2": [2],
        "3": [3],
        "4": [3],
        "5": [3],
        "6": [3],
        "7": [4],
        "8": [4],
        "9": [4],
        "10": [4],
        "11": [4],
        "12": [4],
        "13": [4],
        "14": [4],
        "15": [4],
        "16": [4],
        "17": [4],
        "18": [4],
        "19": [4],
        "20": [4]
      }
    }
  },
  {
    "name": "Barbarian",
    "hit_dice": "1d12 per barbarian level",
    "hit_points_at_1st_level": "12 + your Constitution modifier",
    "hit_points_at_higher_levels": "1d12 (or 7) + your Constitution modifier per barbarian level after 1st",
    "proficiencies": {
      "armor": ["Light armor", "Medium armor", "Shields"],
      "weapons": ["Simple weapons", "Martial weapons"],
      "tools": ["None"],
      "saving_throws": ["Strength", "Constitution"],
      "skills": ["Choose two from Animal Handling, Athletics, Intimidation, Nature, Perception, and Survival"]
    },
    "equipment": [
      "(a) a greataxe or (b) any martial melee weapon",
      "(a) two handaxes or (b) any simple weapon",
      "An explorer's pack and four javelins"
    ],
    "class_features": [
      {
        "level": 1,
        "features": [
          {
            "name": "Rage",
            "description": "In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action. While raging, you gain the following benefits if you aren't wearing heavy armor: You have advantage on Strength checks and Strength saving throws. When you make a melee weapon attack using Strength, you gain a +2 bonus to the damage roll. You have resistance to bludgeoning, piercing, and slashing damage. If you are able to cast spells, you can't cast them or concentrate on them while raging. Your rage lasts for 1 minute. It ends early if you are knocked unconscious or if your turn ends and you haven't attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action."
          },
          {
            "name": "Unarmored Defense",
            "description": "While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit."
          }
        ]
      },
      {
        "level": 2,
        "features": [
          {
            "name": "Reckless Attack",
            "description": "Starting at 2nd level, you can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn."
          },
          {
            "name": "Danger Sense",
            "description": "At 2nd level, you gain an uncanny sense of when things nearby aren't as they should be, giving you an edge when you dodge away from danger. You have advantage on Dexterity saving throws against effects that you can see, such as traps and spells. To gain this benefit, you can't be blinded, deafened, or incapacitated."
          }
        ]
      },
      {
        "level": 3,
        "features": [
          {
            "name": "Primal Path",
            "description": "You choose a path that shapes the nature of your rage. Choose the Path of the Ancestral Guardian, Path of the Battlerager, Path of the Beast, Path of the Berserker, Path of the Giant, Path of the Storm Herald, Path of the Totem Warrior, Path of Wild Magic, or Path of the Zealot, all detailed at the end of the class description. Your choice grants you features at 3rd level and again at 6th, 10th, and 14th levels."
          }
        ]
      },
      {
        "level": 4,
        "features": [
          {
            "name": "Ability Score Improvement",
            "description": "You can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature."
          }
        ]
      },
      {
        "level": 5,
        "features": [
          {
            "name": "Extra Attack",
            "description": "You can attack twice, instead of once, whenever you take the Attack action on your turn."
          },
          {
            "name": "Fast Movement",
            "description": "Starting at 5th level, your speed increases by 10 feet while you aren't wearing heavy armor."
          }
        ]
      },
      {
        "level": 7,
        "features": [
          {
            "name": "Feral Instinct",
            "description": "By 7th level, your instincts are so honed that you have advantage on initiative rolls. Additionally, if you are surprised at the beginning of combat and aren't incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn."
          }
        ]
      },
      {
        "level": 9,
        "features": [
          {
            "name": "Brutal Critical",
            "description": "Beginning at 9th level, you can roll one additional weapon damage die when determining the extra damage for a critical hit with a melee attack. This increases to two additional dice at 13th level and three additional dice at 17th level."
          }
        ]
      },
      {
        "level": 11,
        "features": [
          {
            "name": "Relentless Rage",
            "description": "Starting at 11th level, your rage can keep you fighting despite grievous wounds. If you drop to 0 hit points while you're raging and don't die outright, you can make a DC 10 Constitution saving throw. If you succeed, you drop to 1 hit point instead. Each time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10."
          }
        ]
      },
      {
        "level": 15,
        "features": [
          {
            "name": "Persistent Rage",
            "description": "Beginning at 15th level, your rage is so fierce that it ends early only if you fall unconscious or if you choose to end it."
          }
        ]
      },
      {
        "level": 18,
        "features": [
          {
            "name": "Indomitable Might",
            "description": "Beginning at 18th level, if your total for a Strength check is less than your Strength score, you can use that score in place of the total."
          }
        ]
      },
      {
        "level": 20,
        "features": [
          {
            "name": "Primal Champion",
            "description": "At 20th level, you embody the power of the wilds. Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24."
          }
        ]
      }
    ]
  },
  {
    "name": "Bard",
    "hit_dice": "1d8 per bard level",
    "hit_points_at_1st_level": "8 + your Constitution modifier",
    "hit_points_at_higher_levels": "1d8 (or 5) + your Constitution modifier per bard level after 1st",
    "proficiencies": {
      "armor": ["Light armor"],
      "weapons": ["Simple weapons", "Hand crossbows", "Longswords", "Rapiers", "Shortswords"],
      "tools": ["Three musical instruments of your choice"],
      "saving_throws": ["Dexterity", "Charisma"],
      "skills": ["Any three skills"]
    },
    "equipment": [
      "(a) a rapier, (b) a longsword, or (c) any simple weapon",
      "(a) a diplomat's pack or (b) an entertainer's pack",
      "(a) a lute or (b) any other musical instrument",
      "Leather armor and a dagger"
    ],
    "class_features": [
      {
        "level": 1,
        "features": [
          {
            "name": "Spellcasting",
            "description": "You have learned to untangle and reshape the fabric of reality in harmony with your wishes and music. Your spells are part of your vast repertoire, magic that you can tune to different situations."
          },
          {
            "name": "Bardic Inspiration",
            "description": "You can inspire others through stirring words or music. To do so, you use a bonus action on your turn to choose one creature other than yourself within 60 feet of you who can hear you. That creature gains one Bardic Inspiration die, a d6. Once within the next 10 minutes, the creature can roll the die and add the number rolled to one ability check, attack roll, or saving throw it makes. The creature can wait until after it rolls the d20 before deciding to use the Bardic Inspiration die, but must decide before the DM says whether the roll succeeds or fails. Once the Bardic Inspiration die is rolled, it is lost. A creature can have only one Bardic Inspiration die at a time. You can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain any expended uses when you finish a long rest. Your Bardic Inspiration die changes when you reach certain levels in this class. The die becomes a d8 at 5th level, a d10 at 10th level, and a d12 at 15th level."
          }
        ]
      },
      {
        "level": 2,
        "features": [
          {
            "name": "Jack of All Trades",
            "description": "Starting at 2nd level, you can add half your proficiency bonus, rounded down, to any ability check you make that doesn't already include your proficiency bonus."
          },
          {
            "name": "Song of Rest",
            "description": "Beginning at 2nd level, you can use soothing music or oration to help revitalize your wounded allies during a short rest. If you or any friendly creatures who can hear your performance regain hit points at the end of the short rest by spending one or more Hit Dice, each of those creatures regains an extra 1d6 hit points. The extra hit points increase when you reach certain levels in this class: to 1d8 at 9th level, to 1d10 at 13th level, and to 1d12 at 17th level."
          }
        ]
      },
      {
        "level": 3,
        "features": [
          {
            "name": "Bard College",
            "description": "You delve into the advanced techniques of a bard college of your choice: the College of Creation, College of Eloquence, College of Glamour, College of Lore, College of Spirits, College of Swords, College of Valor, or College of Whispers, all detailed at the end of the class description. Your choice grants you features at 3rd level and again at 6th and 14th level."
          },
          {
            "name": "Expertise",
            "description": "At 3rd level, choose two of your skill proficiencies. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies."
          }
        ]
      },
      {
        "level": 5,
        "features": [
          {
            "name": "Font of Inspiration",
            "description": "Beginning when you reach 5th level, you regain all of your expended uses of Bardic Inspiration when you finish a short or long rest."
          }
        ]
      },
      {
        "level": 6,
        "features": [
          {
            "name": "Countercharm",
            "description": "At 6th level, you gain the ability to use musical notes or words of power to disrupt mind-influencing effects. As an action, you can start a performance that lasts until the end of your next turn. During that time, you and any friendly creatures within 30 feet of you have advantage on saving throws against being frightened or charmed. A creature must be able to hear you to gain this benefit. The performance ends early if you are incapacitated or silenced or if you voluntarily end it (no action required)."
          }
        ]
      },
      {
        "level": 10,
        "features": [
          {
            "name": "Magical Secrets",
            "description": "By 10th level, you have plundered magical knowledge from a wide spectrum of disciplines. Choose two spells from any class, including this one. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip. The chosen spells count as bard spells for you and are included in the number in the Spells Known column of the Bard table. You learn two additional spells from any class at 14th level and again at 18th level."
          }
        ]
      },
      {
        "level": 20,
        "features": [
          {
            "name": "Superior Inspiration",
            "description": "At 20th level, when you roll initiative and have no uses of Bardic Inspiration left, you regain one use."
          }
        ]
      }
    ],
    "spellcasting": {
      "ability": "Charisma",
      "cantrips_known": {
        "1": 2,
        "4": 3,
        "10": 4
      },
      "spells_known": {
        "1": 4,
        "2": 5,
        "3": 6,
        "4": 7,
        "5": 8,
        "6": 9,
        "7": 10,
        "8": 11,
        "9": 12,
        "10": 14,
        "11": 15,
        "12": 15,
        "13": 16,
        "14": 18,
        "15": 19,
        "16": 19,
        "17": 20,
        "18": 22,
        "19": 22,
        "20": 22
      },
      "spell_slots": {
        "1": [2],
        "2": [3],
        "3": [4],
        "4": [4, 2],
        "5": [4, 2],
        "6": [4, 3],
        "7": [4, 3],
        "8": [4, 3, 2],
        "9": [4, 3, 2],
        "10": [4, 3, 3],
        "11": [4, 3, 3],
        "12": [4, 3, 3, 1],
        "13": [4, 3, 3, 1],
        "14": [4, 3, 3, 2],
        "15": [4, 3, 3, 2],
        "16": [4, 3, 3, 2, 1],
        "17": [4, 3, 3, 2, 1],
        "18": [4, 3, 3, 3, 1],
        "19": [4, 3, 3, 3, 2],
        "20": [4, 3, 3, 3, 2]
      }
    }
  },
  {
    "name": "Cleric",
    "hit_dice": "1d8 per cleric level",
    "hit_points_at_1st_level": "8 + your Constitution modifier",
    "hit_points_at_higher_levels": "1d8 (or 5) + your Constitution modifier per cleric level after 1st",
    "proficiencies": {
      "armor": ["Light armor", "Medium armor", "Shields"],
      "weapons": ["Simple weapons"],
      "tools": ["None"],
      "saving_throws": ["Wisdom", "Charisma"],
      "skills": ["Choose two from History, Insight, Medicine, Persuasion, and Religion"]
    },
    "equipment": [
      "(a) a mace or (b) a warhammer (if proficient)",
      "(a) scale mail, (b) leather armor, or (c) chain mail (if proficient)",
      "(a) a light crossbow and 20 bolts or (b) any simple weapon",
      "(a) a priest's pack or (b) an explorer's pack",
      "A shield and a holy symbol"
    ],
    "class_features": [
      {
        "level": 1,
        "features": [
          {
            "name": "Spellcasting",
            "description": "As a conduit for divine power, you can cast cleric spells."
          },
          {
            "name": "Divine Domain",
            "description": "Choose one domain related to your deity: the Knowledge domain, Life domain, Light domain, Nature domain, Tempest domain, Trickery domain, or War domain. Each domain is detailed at the end of the class description, and each one provides examples of gods associated with it. Your choice grants you domain spells and other features when you choose it at 1st level. It also grants you additional ways to use Channel Divinity when you gain that feature at 2nd level, and additional benefits at 6th, 8th, and 17th levels."
          }
        ]
      },
      {
        "level": 2,
        "features": [
          {
            "name": "Channel Divinity",
            "description": "At 2nd level, you gain the ability to channel divine energy directly from your deity, using that energy to fuel magical effects. You start with two such effects: Turn Undead and an effect determined by your domain. Some domains grant you additional effects as you advance in levels, as noted in the domain description. When you use your Channel Divinity, you choose which effect to create. You must then finish a short or long rest to use your Channel Divinity again. Some Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your cleric spell save DC. Beginning at 6th level, you can use your Channel Divinity twice between rests, and beginning at 18th level, you can use it three times between rests. When you finish a short or long rest, you regain your expended uses."
          },
          {
            "name": "Turn Undead",
            "description": "As an action, you present your holy symbol and speak a prayer censuring the undead. Each undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes any damage. A turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly move to a space within 30 feet of you. It also can't take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the Dodge action."
          }
        ]
      },
      {
        "level": 5,
        "features": [
          {
            "name": "Destroy Undead",
            "description": "Starting at 5th level, when an undead fails its saving throw against your Turn Undead feature, the creature is instantly destroyed if its challenge rating is at or below a certain threshold, as shown in the Destroy Undead table."
          }
        ]
      },
      {
        "level": 8,
        "features": [
          {
            "name": "Divine Strike",
            "description": "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 radiant damage to the target. When you reach 14th level, the extra damage increases to 2d8."
          }
        ]
      },
      {
        "level": 10,
        "features": [
          {
            "name": "Divine Intervention",
            "description": "Beginning at 10th level, you can call on your deity to intervene on your behalf when your need is great. Imploring your deity's aid requires you to use your action. Describe the assistance you seek, and roll percentile dice. If you roll a number equal to or lower than your cleric level, your deity intervenes. The DM chooses the nature of the intervention; the effect of any cleric spell or cleric domain spell would be appropriate. If your deity intervenes, you can't use this feature again for 7 days. Otherwise, you can use it again after you finish a long rest. At 20th level, your call for intervention succeeds automatically, no roll required."
          }
        ]
      }
    ],
    "spellcasting": {
      "ability": "Wisdom",
      "cantrips_known": {
        "1": 3,
        "4": 4,
        "10": 5
      },
      "spells_prepared": {
        "formula": "Wisdom modifier + Cleric level (minimum of 1)"
      }
    }
  },
  {
    "name": "Druid",
    "hit_dice": "1d8 per druid level",
    "hit_points_at_1st_level": "8 + your Constitution modifier",
    "hit_points_at_higher_levels": "1d8 (or 5) + your Constitution modifier per druid level after 1st",
    "proficiencies": {
      "armor": ["Light armor", "Medium armor", "Shields"],
      "weapons": ["Clubs", "Daggers", "Darts", "Javelins", "Maces", "Quarterstaffs", "Scimitars", "Sickles", "Slings", "Spears"],
      "tools": ["Herbalism kit"],
      "saving_throws": ["Intelligence", "Wisdom"],
      "skills": ["Choose two from Arcana, Animal Handling, Insight, Medicine, Nature, Perception, Religion, and Survival"]
    },
    "equipment": [
      "(a) a wooden shield or (b) any simple weapon",
      "(a) a scimitar or (b) any simple melee weapon",
      "Leather armor, an explorer's pack, and a druidic focus"
    ],
    "class_features": [
      {
        "level": 1,
        "features": [
          {
            "name": "Druidic",
            "description": "You know Druidic, the secret language of druids. You can speak the language and use it to leave hidden messages. You and others who know this language automatically spot such a message. Others spot the message's presence with a successful DC 15 Wisdom (Perception) check but can't decipher it without magic."
          },
          {
            "name": "Spellcasting",
            "description": "Drawing on the divine essence of nature itself, you can cast spells to shape that essence to your will."
          }
        ]
      },
      {
        "level": 2,
        "features": [
          {
            "name": "Wild Shape",
            "description": "Starting at 2nd level, you can use your action to magically assume the shape of a beast that you have seen before. You can use this feature twice. You regain expended uses when you finish a short or long rest. You can stay in a beast shape for a number of hours equal to half your druid level (rounded down). You then revert to your normal form unless you expend another use of this feature. You can revert to your normal form earlier by using a bonus action on your turn. You automatically revert if you fall unconscious, drop to 0 hit points, or die."
          },
          {
            "name": "Druid Circle",
            "description": "At 2nd level, you choose to identify with a circle of druids: the Circle of the Land or the Circle of the Moon, both detailed at the end of the class description. Your choice grants you features at 2nd level and again at 6th, 10th, and 14th level."
          }
        ]
      },
      {
        "level": 18,
        "features": [
          {
            "name": "Timeless Body",
            "description": "Starting at 18th level, the primal magic that you wield causes you to age more slowly. For every 10 years that pass, your body ages only 1 year."
          },
          {
            "name": "Beast Spells",
            "description": "Beginning at 18th level, you can cast many of your druid spells in any shape you assume using Wild Shape. You can perform the somatic and verbal components of a druid spell while in a beast shape, but you aren't able to provide material components."
          }
        ]
      },
      {
        "level": 20,
        "features": [
          {
            "name": "Archdruid",
            "description": "At 20th level, you can use your Wild Shape an unlimited number of times. Additionally, you can ignore the verbal and somatic components of your druid spells, as well as any material components that lack a cost and aren't consumed by a spell. You gain this benefit in both your normal shape and your beast shape from Wild Shape."
          }
        ]
      }
    ],
    "spellcasting": {
      "ability": "Wisdom",
      "cantrips_known": {
        "1": 2,
        "4": 3,
        "10": 4
      },
      "spells_prepared": {
        "formula": "Wisdom modifier + Druid level (minimum of 1)"
      }
    }
  },
  {
    "name": "Fighter",
    "hit_dice": "1d10 per fighter level",
    "hit_points_at_1st_level": "10 + your Constitution modifier",
    "hit_points_at_higher_levels": "1d10 (or 6) + your Constitution modifier per fighter level after 1st",
    "proficiencies": {
      "armor": ["All armor", "Shields"],
      "weapons": ["Simple weapons", "Martial weapons"],
      "tools": ["None"],
      "saving_throws": ["Strength", "Constitution"],
      "skills": ["Choose two skills from Acrobatics, Animal Handling, Athletics, History, Insight, Intimidation, Perception, and Survival"]
    },
    "equipment": [
      "(a) chain mail or (b) leather armor, longbow, and 20 arrows",
      "(a) a martial weapon and a shield or (b) two martial weapons",
      "(a) a light crossbow and 20 bolts or (b) two handaxes",
      "(a) a dungeoneer's pack or (b) an explorer's pack"
    ],
    "class_features": [
      {
        "level": 1,
        "features": [
          {
            "name": "Fighting Style",
            "description": "You adopt a particular style of fighting as your specialty. Choose one of the following options. You can't take a Fighting Style option more than once, even if you later get to choose again."
          },
          {
            "name": "Second Wind",
            "description": "You have a limited well of stamina that you can draw on to protect yourself from harm. On your turn, you can use a bonus action to regain hit points equal to 1d10 + your fighter level. Once you use this feature, you must finish a short or long rest before you can use it again."
          }
        ]
      },
      {
        "level": 2,
        "features": [
          {
            "name": "Action Surge",
            "description": "Starting at 2nd level, you can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action. Once you use this feature, you must finish a short or long rest before you can use it again. Starting at 17th level, you can use it twice before a rest, but only once on the same turn."
          }
        ]
      },
      {
        "level": 3,
        "features": [
          {
            "name": "Martial Archetype",
            "description": "You choose an archetype that you strive to emulate in your combat styles and techniques. Choose Champion, Battle Master, or Eldritch Knight, all detailed at the end of the class description. The archetype you choose grants you features at 3rd level and again at 7th, 10th, 15th, and 18th level."
          }
        ]
      },
      {
        "level": 5,
        "features": [
          {
            "name": "Extra Attack",
            "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn. The number of attacks increases to three when you reach 11th level in this class and to four when you reach 20th level in this class."
          }
        ]
      }
    ]
  },
  {
    "name": "Monk",
    "hit_dice": "1d8 per monk level",
    "hit_points_at_1st_level": "8 + your Constitution modifier",
    "hit_points_at_higher_levels": "1d8 (or 5) + your Constitution modifier per monk level after 1st",
    "proficiencies": {
      "armor": ["None"],
      "weapons": ["Simple weapons", "Shortswords"],
      "tools": ["Choose one type of artisan's tools or one musical instrument"],
      "saving_throws": ["Strength", "Dexterity"],
      "skills": ["Choose two from Acrobatics, Athletics, History, Insight, Religion, and Stealth"]
    },
    "equipment": [
      "(a) a shortsword or (b) any simple weapon",
      "(a) a dungeoneer's pack or (b) an explorer's pack",
      "10 darts"
    ],
    "class_features": [
      {
        "level": 1,
        "features": [
          {
            "name": "Unarmored Defense",
            "description": "Beginning at 1st level, while you are wearing no armor and not wielding a shield, your AC equals 10 + your Dexterity modifier + your Wisdom modifier."
          },
          {
            "name": "Martial Arts",
            "description": "At 1st level, your practice of martial arts gives you mastery of combat styles that use unarmed strikes and monk weapons, which are shortswords and any simple melee weapons that don't have the two-handed or heavy property. You gain the following benefits while you are unarmed or wielding only monk weapons and you aren't wearing armor or wielding a shield: You can use Dexterity instead of Strength for the attack and damage rolls of your unarmed strikes and monk weapons. You can roll a d4 in place of the normal damage of your unarmed strike or monk weapon. This die changes as you gain monk levels, as shown in the Martial Arts column of the Monk table. When you use the Attack action with an unarmed strike or a monk weapon on your turn, you can make one unarmed strike as a bonus action."
          }
        ]
      },
      {
        "level": 2,
        "features": [
          {
            "name": "Ki",
            "description": "Starting at 2nd level, your training allows you to harness the mystic energy of ki. Your access to this energy is represented by a number of ki points. Your monk level determines the number of points you have. You can spend these points to fuel various ki features. You start knowing three such features: Flurry of Blows, Patient Defense, and Step of the Wind. You learn more ki features as you gain levels in this class. When you spend a ki point, it is unavailable until you finish a short or long rest, at the end of which you draw all of your expended ki back into yourself. You must spend at least 30 minutes of the rest meditating to regain your ki points."
          },
          {
            "name": "Unarmored Movement",
            "description": "Starting at 2nd level, your speed increases by 10 feet while you are not wearing armor or wielding a shield. This bonus increases when you reach certain monk levels, as shown in the Monk table."
          }
        ]
      },
      {
        "level": 3,
        "features": [
          {
            "name": "Monastic Tradition",
            "description": "When you reach 3rd level, you commit yourself to a monastic tradition: the Way of Shadow, Way of the Four Elements, or Way of the Open Hand, all detailed at the end of the class description. Your tradition grants you features at 3rd level and again at 6th, 11th, and 17th level."
          },
          {
            "name": "Deflect Missiles",
            "description": "Starting at 3rd level, you can use your reaction to deflect or catch the missile when you are hit by a ranged weapon attack. When you do so, the damage you take from the attack is reduced by 1d10 + your Dexterity modifier + your monk level. If you reduce the damage to 0, you can catch the missile if it is small enough for you to hold in one hand and you have at least one hand free. If you catch a missile in this way, you can spend 1 ki point to make a ranged attack with the weapon or piece of ammunition you just caught, as part of the same reaction. You make this attack with proficiency, regardless of your weapon proficiencies, and the missile counts as a monk weapon for the attack."
          }
        ]
      },
      {
        "level": 4,
        "features": [
          {
            "name": "Slow Fall",
            "description": "Beginning at 4th level, you can use your reaction when you fall to reduce any falling damage you take by an amount equal to five times your monk level."
          }
        ]
      },
      {
        "level": 5,
        "features": [
          {
            "name": "Extra Attack",
            "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
          },
          {
            "name": "Stunning Strike",
            "description": "Starting at 5th level, you can interfere with the flow of ki in an opponent's body. When you hit another creature with a melee weapon attack, you can spend 1 ki point to attempt a stunning strike. The target must succeed on a Constitution saving throw or be stunned until the end of your next turn."
          }
        ]
      },
      {
        "level": 6,
        "features": [
          {
            "name": "Ki-Empowered Strikes",
            "description": "Starting at 6th level, your unarmed strikes count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage."
          }
        ]
      },
      {
        "level": 7,
        "features": [
          {
            "name": "Evasion",
            "description": "At 7th level, your instinctive agility lets you dodge out of the way of certain area effects, such as a blue dragon's lightning breath or a fireball spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail."
          }
        ]
      },
      {
        "level": 9,
        "features": [
          {
            "name": "Unarmored Movement Improvement",
            "description": "At 9th level, you gain the ability to move along vertical surfaces and across water on your turn without falling during the move."
          }
        ]
      },
      {
        "level": 13,
        "features": [
          {
            "name": "Tongue of the Sun and Moon",
            "description": "Starting at 13th level, you learn to touch the ki of other minds so that you understand all spoken languages. Moreover, any creature that can understand a language can understand what you say."
          }
        ]
      },
      {
        "level": 14,
        "features": [
          {
            "name": "Diamond Soul",
            "description": "Beginning at 14th level, your mastery of ki grants you proficiency in all saving throws. Additionally, whenever you make a saving throw and fail, you can spend 1 ki point to reroll it and take the second result."
          }
        ]
      },
      {
        "level": 18,
        "features": [
          {
            "name": "Empty Body",
            "description": "Beginning at 18th level, you can use your action to spend 4 ki points to become invisible for 1 minute. During that time, you also have resistance to all damage but force damage. Additionally, you can spend 8 ki points to cast the astral projection spell, without needing material components. When you do so, you can't take any other creatures with you."
          }
        ]
      },
      {
        "level": 20,
        "features": [
          {
            "name": "Perfect Self",
            "description": "At 20th level, when you roll for initiative and have no ki points remaining, you regain 4 ki points."
          }
        ]
      }
    ]
  },
  {
    "name": "Paladin",
    "hit_dice": "1d10 per paladin level",
    "hit_points_at_1st_level": "10 + your Constitution modifier",
    "hit_points_at_higher_levels": "1d10 (or 6) + your Constitution modifier per paladin level after 1st",
    "proficiencies": {
      "armor": ["All armor", "Shields"],
      "weapons": ["Simple weapons", "Martial weapons"],
      "tools": ["None"],
      "saving_throws": ["Wisdom", "Charisma"],
      "skills": ["Choose two from Athletics, Insight, Intimidation, Medicine, Persuasion, and Religion"]
    },
    "equipment": [
      "(a) a martial weapon and a shield or (b) two martial weapons",
      "(a) five javelins or (b) any simple melee weapon",
      "(a) a priest's pack or (b) an explorer's pack",
      "Chain mail and a holy symbol"
    ],
    "class_features": [
      {
        "level": 1,
        "features": [
          {
            "name": "Divine Sense",
            "description": "The presence of strong evil registers on your senses like a noxious odor, and powerful good rings like heavenly music in your ears. As an action, you can open your awareness to detect such forces. Until the end of your next turn, you know the location of any celestial, fiend, or undead within 60 feet of you that is not behind total cover. You know the type (celestial, fiend, or undead) of any being whose presence you sense, but not its identity (the vampire Count Strahd von Zarovich, for instance). Within the same radius, you also detect the presence of any place or object that has been consecrated or desecrated, as with the hallow spell. You can use this feature a number of times equal to 1 + your Charisma modifier. When you finish a long rest, you regain all expended uses."
          },
          {
            "name": "Lay on Hands",
            "description": "Your blessed touch can heal wounds. You have a pool of healing power that replenishes when you take a long rest. With that pool, you can restore a total number of hit points equal to your paladin level × 5. As an action, you can touch a creature and draw power from the pool to restore a number of hit points to that creature, up to the maximum amount remaining in your pool. Alternatively, you can expend 5 hit points from your pool of healing to cure the target of one disease or neutralize one poison affecting it. You can cure multiple diseases and neutralize multiple poisons with a single use of Lay on Hands, expending hit points separately for each one. This feature has no effect on undead and constructs."
          }
        ]
      },
      {
        "level": 2,
        "features": [
          {
            "name": "Fighting Style",
            "description": "You adopt a particular style of fighting as your specialty. Choose one of the following options. You can't take a Fighting Style option more than once, even if you later get to choose again."
          },
          {
            "name": "Spellcasting",
            "description": "By 2nd level, you have learned to draw on divine magic through meditation and prayer to cast spells as a cleric does."
          },
          {
            "name": "Divine Smite",
            "description": "Starting at 2nd level, when you hit a creature with a melee weapon attack, you can expend one spell slot to deal radiant damage to the target, in addition to the weapon's damage. The extra damage is 2d8 for a 1st-level spell slot, plus 1d8 for each spell level higher than 1st, to a maximum of 5d8. The damage increases by 1d8 if the target is an undead or a fiend, to a maximum of 6d8."
          }
        ]
      },
      {
        "level": 3,
        "features": [
          {
            "name": "Sacred Oath",
            "description": "When you reach 3rd level, you swear the oath that binds you as a paladin forever. Up to this time you have been in a preparatory stage, committed to the path but not yet sworn to it. Choose the Oath of Devotion, Oath of the Ancients, Oath of Vengeance, Oath of Conquest, Oath of the Crown, Oath of Redemption, or Oath of the Watchers, all detailed at the end of the class description. Your choice grants you features at 3rd level and again at 7th, 15th, and 20th level."
          },
          {
            "name": "Channel Divinity",
            "description": "Your oath allows you to channel divine energy to fuel magical effects. Each Sacred Oath option describes what Channel Divinity effects you can use. When you use your Channel Divinity, you choose which effect to create. You must then finish a short or long rest to use your Channel Divinity again. Some Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your paladin spell save DC."
          }
        ]
      },
      {
        "level": 5,
        "features": [
          {
            "name": "Extra Attack",
            "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
          }
        ]
      },
      {
        "level": 6,
        "features": [
          {
            "name": "Aura of Protection",
            "description": "Starting at 6th level, whenever you or a friendly creature within 10 feet of you must make a saving throw, the creature gains a bonus to the saving throw equal to your Charisma modifier (with a minimum bonus of +1). You must be conscious to grant this bonus. At 18th level, the range of this aura increases to 30 feet."
          }
        ]
      },
      {
        "level": 10,
        "features": [
          {
            "name": "Aura of Devotion",
            "description": "Starting at 10th level, you and friendly creatures within 10 feet of you can't be charmed while you are conscious. At 18th level, the range of this aura increases to 30 feet."
          }
        ]
      },
      {
        "level": 11,
        "features": [
          {
            "name": "Improved Divine Smite",
            "description": "By 11th level, you are so suffused with righteous might that all your melee weapon strikes carry divine power with them. Whenever you hit a creature with a melee weapon, the creature takes an extra 1d8 radiant damage. If you also use your Divine Smite with an attack, you add this damage to the extra damage of your Divine Smite."
          }
        ]
      },
      {
        "level": 14,
        "features": [
          {
            "name": "Cleansing Touch",
            "description": "Beginning at 14th level, you can use your action to end one spell on yourself or on one willing creature that you touch. You can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain expended uses when you finish a long rest."
          }
        ]
      },
      {
        "level": 20,
        "features": [
          {
            "name": "Sacred Oath Feature",
            "description": "At 20th level, you gain a feature determined by your Sacred Oath."
          }
        ]
      }
    ],
    "spellcasting": {
      "ability": "Charisma",
      "cantrips_known": {
        "formula": "None"
      }
    }
  },
  {
    "name": "Ranger",
    "hit_dice": "1d10 per ranger level",
    "hit_points_at_1st_level": "10 + your Constitution modifier",
    "hit_points_at_higher_levels": "1d10 (or 6) + your Constitution modifier per ranger level after 1st",
    "proficiencies": {
      "armor": ["Light armor", "Medium armor", "Shields"],
      "weapons": ["Simple weapons", "Martial weapons"],
      "tools": ["None"],
      "saving_throws": ["Strength", "Dexterity"],
      "skills": ["Choose three from Animal Handling, Athletics, Insight, Investigation, Nature, Perception, Stealth, and Survival"]
    },
    "equipment": [
      "(a) scale mail or (b) leather armor",
      "(a) two shortswords or (b) two simple melee weapons",
      "(a) a dungeoneer's pack or (b) an explorer's pack",
      "A longbow and a quiver of 20 arrows"
    ],
    "class_features": [
      {
        "level": 1,
        "features": [
          {
            "name": "Favored Enemy",
            "description": "Beginning at 1st level, you have significant experience studying, tracking, hunting, and even talking to a certain type of enemy. Choose a type of favored enemy: aberrations, beasts, celestials, constructs, dragons, elementals, fey, fiends, giants, monstrosities, oozes, plants, or undead. Alternatively, you can select two races of humanoid (such as gnolls and orcs) as favored enemies. You have advantage on Wisdom (Survival) checks to track your favored enemies, as well as on Intelligence checks to recall information about them. When you gain this feature, you also learn one language of your choice that is spoken by your favored enemies, if they speak one at all."
          },
          {
            "name": "Natural Explorer",
            "description": "You are particularly familiar with one type of natural environment and are adept at traveling and surviving in such regions. Choose one type of favored terrain: arctic, coast, desert, forest, grassland, mountain, swamp, or the Underdark. When you make an Intelligence or Wisdom check related to your favored terrain, your proficiency bonus is doubled if you are using a skill that you're proficient in. While traveling for an hour or more in your favored terrain, you gain the following benefits: Difficult terrain doesn't slow your group's travel. Your group can't become lost except by magical means. Even when you are engaged in another activity while traveling (such as foraging, navigating, or tracking), you remain alert to danger. If you are traveling alone, you can move stealthily at a normal pace. When you forage, you find twice as much food as you normally would. While tracking other creatures, you also learn their exact number, their sizes, and how long ago they passed through the area."
          }
        ]
      },
      {
        "level": 2,
        "features": [
          {
            "name": "Fighting Style",
            "description": "You adopt a particular style of fighting as your specialty. Choose one of the following options. You can't take a Fighting Style option more than once, even if you later get to choose again."
          },
          {
            "name": "Spellcasting",
            "description": "By the time you reach 2nd level, you have learned to use the magical essence of nature to cast spells, much as a druid does."
          }
        ]
      },
      {
        "level": 3,
        "features": [
          {
            "name": "Ranger Archetype",
            "description": "At 3rd level, you choose an archetype that you strive to emulate: the Beast Master, the Hunter, or another archetype. Your choice grants you features at 3rd level and again at 7th, 11th, and 15th level."
          },
          {
            "name": "Primeval Awareness",
            "description": "Beginning at 3rd level, you can use your action and expend one ranger spell slot to focus your awareness on the region around you. For 1 minute per level of the spell slot you expend, you can sense whether the following types of creatures are present within 1 mile of you (or within up to 6 miles if you are in your favored terrain): aberrations, celestials, dragons, elementals, fey, fiends, and undead. This feature doesn't reveal the creatures' location or number."
          }
        ]
      },
      {
        "level": 5,
        "features": [
          {
            "name": "Extra Attack",
            "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."
          }
        ]
      },
      {
        "level": 8,
        "features": [
          {
            "name": "Land's Stride",
            "description": "Starting at 8th level, moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard. In addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such those created by the entangle spell."
          }
        ]
      },
      {
        "level": 10,
        "features": [
          {
            "name": "Hide in Plain Sight",
            "description": "Starting at 10th level, you can spend 1 minute creating camouflage for yourself. You must have access to fresh mud, dirt, plants, soot, and other naturally occurring materials with which to create your camouflage. Once you are camouflaged in this way, you can try to hide by pressing yourself up against a solid surface, such as a tree or wall, that is at least as tall and wide as you are. You gain a +10 bonus to Dexterity (Stealth) checks as long as you remain there without moving or taking actions. Once you leave your hiding place, you must camouflage yourself again to gain this benefit."
          }
        ]
      },
      {
        "level": 14,
        "features": [
          {
            "name": "Vanish",
            "description": "Starting at 14th level, you can use the Hide action as a bonus action on your turn. Also, you can't be tracked by nonmagical means, unless you choose to leave a trail."
          }
        ]
      },
      {
        "level": 18,
        "features": [
          {
            "name": "Feral Senses",
            "description": "At 18th level, you gain preternatural senses that help you fight creatures you can't see. When you attack a creature you can't see, your inability to see it doesn't impose disadvantage on your attack rolls against it. You are also aware of the location of any invisible creature within 30 feet of you, provided that the creature isn't hidden from you and you aren't blinded or deafened."
          }
        ]
      },
      {
        "level": 20,
        "features": [
          {
            "name": "Foe Slayer",
            "description": "At 20th level, you become an unparalleled hunter of your enemies. Once on each of your turns, you can add your Wisdom modifier to the attack roll or the damage roll of an attack you make against one of your favored enemies. You can choose to use this feature before or after the roll, but before any effects of the roll are applied."
          }
        ]
      }
    ],
    "spellcasting": {
      "ability": "Wisdom",
      "spells_known": {
        "2": 2,
        "3": 3,
        "4": 3,
        "5": 4,
        "6": 4,
        "7": 5,
        "8": 5,
        "9": 6,
        "10": 6,
        "11": 7,
        "12": 7,
        "13": 8,
        "14": 8,
        "15": 9,
        "16": 9,
        "17": 10,
        "18": 10,
        "19": 11,
        "20": 11
      }
    }
  },
  {
    "name": "Rogue",
    "hit_dice": "1d8 per rogue level",
    "hit_points_at_1st_level": "8 + your Constitution modifier",
    "hit_points_at_higher_levels": "1d8 (or 5) + your Constitution modifier per rogue level after 1st",
    "proficiencies": {
      "armor": ["Light armor"],
      "weapons": ["Simple weapons", "Hand crossbows", "Longswords", "Rapiers", "Shortswords"],
      "tools": ["Thieves' tools"],
      "saving_throws": ["Dexterity", "Intelligence"],
      "skills": ["Choose four from Acrobatics, Athletics, Deception, Insight, Intimidation, Investigation, Perception, Performance, Persuasion, Sleight of Hand, and Stealth"]
    },
    "equipment": [
      "(a) a rapier or (b) a shortsword",
      "(a) a shortbow and quiver of 20 arrows or (b) a shortsword",
      "(a) a burglar's pack, (b) a dungeoneer's pack, or (c) an explorer's pack",
      "Leather armor, two daggers, and thieves' tools"
    ],
    "class_features": [
      {
        "level": 1,
        "features": [
          {
            "name": "Expertise",
            "description": "At 1st level, choose two of your skill proficiencies, or one of your skill proficiencies and your proficiency with thieves' tools. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies."
          },
          {
            "name": "Sneak Attack",
            "description": "Beginning at 1st level, you know how to strike subtly and exploit a foe's distraction. Once per turn, you can deal an extra 1d6 damage to one creature you hit with an attack if you have advantage on the attack roll. The attack must use a finesse or ranged weapon. You don't need advantage on the attack roll if another enemy of the target is within 5 feet of it, that enemy isn't incapacitated, and you don't have disadvantage on the attack roll. The amount of the extra damage increases as you gain levels in this class, as shown in the Sneak Attack column of the Rogue table."
          },
          {
            "name": "Thieves' Cant",
            "description": "During your rogue training you learned thieves' cant, a secret mix of dialect, jargon, and code that allows you to hide messages in seemingly normal conversation. Only another creature that knows thieves' cant understands such messages. It takes four times longer to convey such a message than it does to speak the same idea plainly. In addition, you understand a set of secret signs and symbols used to convey short, simple messages, such as whether an area is dangerous or the territory of a thieves' guild, whether loot is nearby, or whether the people in an area are easy marks or will provide a safe house for thieves on the run."
          }
        ]
      },
      {
        "level": 2,
        "features": [
          {
            "name": "Cunning Action",
            "description": "Starting at 2nd level, your quick thinking and agility allow you to move and act quickly. You can take a bonus action on each of your turns in combat. This action can be used only to take the Dash, Disengage, or Hide action."
          }
        ]
      },
      {
        "level": 3,
        "features": [
          {
            "name": "Roguish Archetype",
            "description": "At 3rd level, you choose an archetype that you emulate in the exercise of your rogue abilities: Thief, Assassin, Arcane Trickster, Inquisitive, Mastermind, Scout, Swashbuckler, or another archetype, all detailed at the end of the class description. Your archetype choice grants you features at 3rd level and again at 9th, 13th, and 17th level."
          }
        ]
      },
      {
        "level": 5,
        "features": [
          {
            "name": "Uncanny Dodge",
            "description": "Starting at 5th level, when an attacker that you can see hits you with an attack, you can use your reaction to halve the attack's damage against you."
          }
        ]
      },
      {
        "level": 7,
        "features": [
          {
            "name": "Evasion",
            "description": "At 7th level, you can nimbly dodge out of the way of certain area effects, such as a red dragon's fiery breath or an ice storm spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail."
          }
        ]
      },
      {
        "level": 11,
        "features": [
          {
            "name": "Reliable Talent",
            "description": "By 11th level, you have refined your chosen skills until they approach perfection. Whenever you make an ability check that lets you add your proficiency bonus, you can treat a d20 roll of 9 or lower as a 10."
          }
        ]
      },
      {
        "level": 14,
        "features": [
          {
            "name": "Blindsense",
            "description": "Starting at 14th level, if you are able to hear, you are aware of the location of any hidden or invisible creature within 10 feet of you."
          }
        ]
      },
      {
        "level": 15,
        "features": [
          {
            "name": "Slippery Mind",
            "description": "By 15th level, you have acquired greater mental strength. You gain proficiency in Wisdom saving throws."
          }
        ]
      },
      {
        "level": 18,
        "features": [
          {
            "name": "Elusive",
            "description": "Beginning at 18th level, you are so evasive that attackers rarely gain the upper hand against you. No attack roll has advantage against you unless you are incapacitated."
          }
        ]
      },
      {
        "level": 20,
        "features": [
          {
            "name": "Stroke of Luck",
            "description": "At 20th level, you have an uncanny knack for succeeding when you need to. If your attack misses a target within range, you can turn the miss into a hit. Alternatively, if you fail an ability check, you can treat the d20 roll as a 20. Once you use this feature, you can't use it again until you finish a short or long rest."
          }
        ]
      }
    ]
  },
  {
    "name": "Sorcerer",
    "hit_dice": "1d6 per sorcerer level",
    "hit_points_at_1st_level": "6 + your Constitution modifier",
    "hit_points_at_higher_levels": "1d6 (or 4) + your Constitution modifier per sorcerer level after 1st",
    "proficiencies": {
      "armor": ["None"],
      "weapons": ["Daggers", "Darts", "Slings", "Quarterstaffs", "Light crossbows"],
      "tools": ["None"],
      "saving_throws": ["Constitution", "Charisma"],
      "skills": ["Choose two from Arcana, Deception, Insight, Intimidation, Persuasion, and Religion"]
    },
    "equipment": [
      "(a) a light crossbow and 20 bolts or (b) any simple weapon",
      "(a) a component pouch or (b) an arcane focus",
      "(a) a dungeoneer's pack or (b) an explorer's pack",
      "Two daggers"
    ],
    "class_features": [
      {
        "level": 1,
        "features": [
          {
            "name": "Spellcasting",
            "description": "An event in your past, or in the life of a parent or ancestor, left an indelible mark on you, infusing you with arcane magic. This font of magic, whatever its origin, fuels your spells."
          },
          {
            "name": "Sorcerous Origin",
            "description": "Choose a sorcerous origin, which describes the source of your innate magical power: Draconic Bloodline, Wild Magic, Aberrant Mind, Clockwork Soul, Divine Soul, Shadow Magic, or Storm Sorcery, all detailed at the end of the class description. Your choice grants you features when you choose it at 1st level and again at 6th, 14th, and 18th level."
          }
        ]
      },
      {
        "level": 2,
        "features": [
          {
            "name": "Font of Magic",
            "description": "At 2nd level, you tap into a deep wellspring of magic within yourself. This wellspring is represented by sorcery points, which allow you to create a variety of magical effects."
          },
          {
            "name": "Flexible Casting",
            "description": "You can use your sorcery points to gain additional spell slots, or sacrifice spell slots to gain additional sorcery points. You learn other ways to use your sorcery points as you reach higher levels."
          }
        ]
      },
      {
        "level": 3,
        "features": [
          {
            "name": "Metamagic",
            "description": "At 3rd level, you gain the ability to twist your spells to suit your needs. You gain two Metamagic options of your choice. You gain another one at 10th and 17th level. You can use only one Metamagic option on a spell when you cast it, unless otherwise noted."
          }
        ]
      },
      {
        "level": 20,
        "features": [
          {
            "name": "Sorcerous Restoration",
            "description": "At 20th level, you regain 4 expended sorcery points whenever you finish a short rest."
          }
        ]
      }
    ],
    "spellcasting": {
      "ability": "Charisma",
      "cantrips_known": {
        "1": 4,
        "4": 5,
        "10": 6
      },
      "spells_known": {
        "1": 2,
        "2": 3,
        "3": 4,
        "4": 5,
        "5": 6,
        "6": 7,
        "7": 8,
        "8": 9,
        "9": 10,
        "10": 11,
        "11": 12,
        "12": 12,
        "13": 13,
        "14": 13,
        "15": 14,
        "16": 14,
        "17": 15,
        "18": 15,
        "19": 15,
        "20": 15
      }
    }
  },
  {
    "name": "Warlock",
    "hit_dice": "1d8 per warlock level",
    "hit_points_at_1st_level": "8 + your Constitution modifier",
    "hit_points_at_higher_levels": "1d8 (or 5) + your Constitution modifier per warlock level after 1st",
    "proficiencies": {
      "armor": ["Light armor"],
      "weapons": ["Simple weapons"],
      "tools": ["None"],
      "saving_throws": ["Wisdom", "Charisma"],
      "skills": ["Choose two skills from Arcana, Deception, History, Intimidation, Investigation, Nature, and Religion"]
    },
    "equipment": [
      "(a) a light crossbow and 20 bolts or (b) any simple weapon",
      "(a) a component pouch or (b) an arcane focus",
      "(a) a scholar's pack or (b) a dungeoneer's pack",
      "Leather armor, any simple weapon, and two daggers"
    ],
    "class_features": [
      {
        "level": 1,
        "features": [
          {
            "name": "Otherworldly Patron",
            "description": "At 1st level, you have struck a bargain with an otherworldly being of your choice: the Archfey, the Fiend, the Great Old One, the Celestial, the Fathomless, the Genie, the Hexblade, or the Undead, all detailed at the end of the class description. Your choice grants you features at 1st level and again at 6th, 10th, and 14th level."
          },
          {
            "name": "Pact Magic",
            "description": "Your arcane research and the magic bestowed on you by your patron have given you facility with spells."
          }
        ]
      },
      {
        "level": 2,
        "features": [
          {
            "name": "Eldritch Invocations",
            "description": "In your study of occult lore, you have unearthed eldritch invocations, fragments of forbidden knowledge that imbue you with an abiding magical ability. At 2nd level, you gain two eldritch invocations of your choice. Your invocation options are detailed at the end of the class description. When you gain certain warlock levels, you gain additional invocations of your choice, as shown in the Invocations Known column of the Warlock table. Additionally, when you gain a level in this class, you can choose one of the invocations you know and replace it with another invocation that you could learn at that level."
          }
        ]
      },
      {
        "level": 3,
        "features": [
          {
            "name": "Pact Boon",
            "description": "At 3rd level, your otherworldly patron bestows a gift upon you for your loyal service. You gain one of the following features of your choice: Pact of the Blade, Pact of the Chain, Pact of the Tome, or Pact of the Talisman."
          }
        ]
      },
      {
        "level": 11,
        "features": [
          {
            "name": "Mystic Arcanum",
            "description": "At 11th level, your patron bestows upon you a magical secret called an arcanum. Choose one 6th-level spell from the warlock spell list as this arcanum. You can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do so again. At higher levels, you gain more warlock spells of your choice that can be cast in this way: one 7th-level spell at 13th level, one 8th-level spell at 15th level, and one 9th-level spell at 17th level. You regain all uses of your Mystic Arcanum when you finish a long rest."
          }
        ]
      },
      {
        "level": 20,
        "features": [
          {
            "name": "Eldritch Master",
            "description": "At 20th level, you can draw on your inner reserve of mystical power while entreating your patron to regain expended spell slots. You can spend 1 minute entreating your patron for aid to regain all your expended spell slots from your Pact Magic feature. Once you regain spell slots with this feature, you must finish a long rest before you can do so again."
          }
        ]
      }
    ],
    "spellcasting": {
      "ability": "Charisma",
      "cantrips_known": {
        "1": 2,
        "4": 3,
        "10": 4
      },
      "spell_slots": {
        "1": [1],
        "2": [2],
        "3": [2],
        "4": [2],
        "5": [2],
        "6": [2],
        "7": [2],
        "8": [2],
        "9": [2],
        "10": [2],
        "11": [3],
        "12": [3],
        "13": [3],
        "14": [3],
        "15": [3],
        "16": [3],
        "17": [4],
        "18": [4],
        "19": [4],
        "20": [4]
      },
      "spell_slot_level": {
        "1": 1,
        "2": 1,
        "3": 2,
        "4": 2,
        "5": 3,
        "6": 3,
        "7": 4,
        "8": 4,
        "9": 5,
        "10": 5,
        "11": 5,
        "12": 5,
        "13": 5,
        "14": 5,
        "15": 5,
        "16": 5,
        "17": 5,
        "18": 5,
        "19": 5,
        "20": 5
      },
      "spells_known": {
        "1": 2,
        "2": 3,
        "3": 4,
        "4": 5,
        "5": 6,
        "6": 7,
        "7": 8,
        "8": 9,
        "9": 10,
        "10": 10,
        "11": 11,
        "12": 11,
        "13": 12,
        "14": 12,
        "15": 13,
        "16": 13,
        "17": 14,
        "18": 14,
        "19": 15,
        "20": 15
      }
    }
  },
  {
    "name": "Wizard",
    "hit_dice": "1d6 per wizard level",
    "hit_points_at_1st_level": "6 + your Constitution modifier",
    "hit_points_at_higher_levels": "1d6 (or 4) + your Constitution modifier per wizard level after 1st",
    "proficiencies": {
      "armor": ["None"],
      "weapons": ["Daggers", "Darts", "Slings", "Quarterstaffs", "Light crossbows"],
      "tools": ["None"],
      "saving_throws": ["Intelligence", "Wisdom"],
      "skills": ["Choose two from Arcana, History, Insight, Investigation, Medicine, and Religion"]
    },
    "equipment": [
      "(a) a quarterstaff or (b) a dagger",
      "(a) a component pouch or (b) an arcane focus",
      "(a) a scholar's pack or (b) an explorer's pack",
      "A spellbook"
    ],
    "class_features": [
      {
        "level": 1,
        "features": [
          {
            "name": "Spellcasting",
            "description": "As a student of arcane magic, you have a spellbook containing spells that show the first glimmerings of your true power."
          },
          {
            "name": "Arcane Recovery",
            "description": "You have learned to regain some of your magical energy by studying your spellbook. Once per day when you finish a short rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your wizard level (rounded up), and none of the slots can be 6th level or higher."
          }
        ]
      },
      {
        "level": 2,
        "features": [
          {
            "name": "Arcane Tradition",
            "description": "When you reach 2nd level, you choose an arcane tradition, shaping your practice of magic through one of the following specializations: Abjuration, Conjuration, Divination, Enchantment, Evocation, Illusion, Necromancy, or Transmutation, all detailed at the end of the class description. Your choice grants you features at 2nd level and again at 6th, 10th, and 14th level."
          }
        ]
      },
      {
        "level": 18,
        "features": [
          {
            "name": "Spell Mastery",
            "description": "At 18th level, you have achieved such mastery over certain spells that you can cast them at will. Choose a 1st-level wizard spell and a 2nd-level wizard spell that are in your spellbook. You can cast those spells at their lowest level without expending a spell slot when you have them prepared. If you want to cast either spell at a higher level, you must expend a spell slot as normal. By spending 8 hours in study, you can exchange one or both of the spells you chose for different spells of the same levels."
          }
        ]
      },
      {
        "level": 20,
        "features": [
          {
            "name": "Signature Spells",
            "description": "When you reach 20th level, you gain mastery over two powerful spells and can cast them with little effort. Choose two 3rd-level wizard spells in your spellbook as your signature spells. You always have these spells prepared, they don't count against the number of spells you have prepared, and you can cast each of them once at 3rd level without expending a spell slot. When you do so, you can't do so again until you finish a short or long rest. If you want to cast either spell at a higher level, you must expend a spell slot as normal."
          }
        ]
      }
    ],
    "spellcasting": {
      "ability": "Intelligence",
      "cantrips_known": {
        "1": 3,
        "4": 4,
        "10": 5
      },
      "spells_in_spellbook": {
        "formula": "6 + (2 × Wizard Level)"
      },
      "spells_prepared": {
        "formula": "Intelligence modifier + Wizard Level (minimum of 1)"
      }
    }
  }
]

